app/controllers/products_controller.rb

INSERT INTO "products" ("name", "photo", "description", "price", "is", "_available", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save